{
  "stories": [
    {
      "id": "1",
      "title": "అమ్మ చేతుల రుచి",
      "excerpt": "గ్రామంలో పెరిగిన అమ్మ చేతుల వంట రుచిని మరచిపోలేని కథ. పట్టణంలో ఉద్యోగం చేస్తున్న కొడుకు ఇంటికి వచ్చినప్పుడు...",
      "content": "గ్రామంలో పెరిగిన నేను పట్టణంలో ఉద్యోగం చేస్తున్నాను. ఎంత రుచికరమైన హోటల్ ఆహారం తిన్నా, అమ్మ చేతుల వంట రుచి మాత్రం మరచిపోలేకపోతున్నాను. ఈ వారాంతంలో ఇంటికి వెళ్లాను...\n\nఅమ్మ నన్ను చూసి చాలా సంతోషించింది. వెంటనే వంటగదిలోకి వెళ్లి నా ఇష్టమైన వంటకాలు చేయడం మొదలుపెట్టింది. ఆ వాసన, ఆ ప్రేమ, ఆ శ్రద్ధ... ఇవన్నీ కలిసి ఒక అద్భుతమైన అనుభవం.\n\nఈ కథలో అమ్మ ప్రేమ, కుటుంబ బంధాలు, మరియు మన మూలాలను మరచిపోకూడదని చెప్పే సందేశం ఉంది.",
      "category": "family",
      "tags": ["అమ్మ", "కుటుంబం", "వంట", "గ్రామం"],
      "publishedDate": "2024-12-15",
      "readingTime": 8,
      "featured": true,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 245
    },
    {
      "id": "2",
      "title": "పల్లెటూరి పండుగ",
      "excerpt": "మన గ్రామంలో జరిగే పండుగల వైభవం, ప్రజల ఐక్యత, సంప్రదాయాల పాలన గురించిన హృదయస్పర్శీ కథ...",
      "content": "మా గ్రామంలో దసరా పండుగ వచ్చింది. పూర్వం లాగే ఈసారి కూడా గ్రామం మొత్తం ఒక కుటుంబంలా కలిసి పండుగ జరుపుకుంటుంది...\n\nప్రతి ఇంటి నుండి వంటకాలు, ప్రతి వ్యక్తి తన వంతు సహకారం. పిల్లలు, పెద్దలు అందరూ కలిసి నృత్యాలు, పాటలు. ఈ ఐక్యత, ఈ సంప్రదాయం మన సంస్కృతి యొక్క అసలు శక్తి.\n\nఈ కథ మన సంప్రదాయాలను కాపాడుకోవాల్సిన అవసరం గురించి చెబుతుంది.",
      "category": "culture",
      "tags": ["పండుగ", "సంప్రదాయం", "గ్రామం", "ఐక్యత"],
      "publishedDate": "2024-12-10",
      "readingTime": 12,
      "featured": true,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 189
    },
    {
      "id": "3",
      "title": "కాలేజీ రోజుల స్నేహం",
      "excerpt": "కాలేజీలో కలిసిన స్నేహితులు, వారి కలలు, ఆశలు, నిరాశలు. జీవితంలో వేర్వేరు దిశలకు వెళ్లిన తర్వాత కూడా...",
      "content": "కాలేజీ రోజుల్లో మేము ముగ్గురం చాలా మంచి స్నేహితులం. రాజు, రవి మరియు నేను. మా కలలు, మా ప్రణాలికలు అన్నీ ఒకేలా ఉండేవి...\n\nకానీ కాలేజీ పూర్తయిన తర్వాత మేము వేర్వేరు దిశలకు వెళ్లాము. రాజు ఇంజనీర్ అయ్యాడు, రవి వ్యాపారం చేస్తున్నాడు, నేను రచయితను అయ్యాను.\n\nఇప్పుడు 15 సంవత్సరాల తర్వాత మళ్లీ కలుసుకున్నాము. ఆ పాత స్నేహం, ఆ జ్ఞాపకాలు... కొన్ని బంధాలు కాలాన్ని అధిగమిస్తాయి.",
      "category": "youth",
      "tags": ["స్నేహం", "కాలేజీ", "యువత", "కలలు"],
      "publishedDate": "2024-12-05",
      "readingTime": 10,
      "featured": false,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 156
    },
    {
      "id": "4",
      "title": "రైతు కష్టాలు",
      "excerpt": "వర్షాలు లేకపోవడం, పంట నష్టం, అప్పుల భారం... ఒక రైతు కుటుంబం ఎదుర్కొనే సమస్యలు మరియు వారి పోరాట గాథ...",
      "content": "రామయ్య మా గ్రామంలో ఒక చిన్న రైతు. అతని దగ్గర రెండు ఎకరాల భూమి ఉంది. ఈ సంవత్సరం వర్షాలు రాలేదు, పంట మొత్తం నష్టమైంది...\n\nఅప్పుల భారం, కుటుంబ బాధ్యతలు, పిల్లల చదువు... అన్నీ కలిసి రామయ్యను చాలా ఇబ్బంది పెట్టాయి. కానీ అతను వదులుకోలేదు.\n\nఈ కథ మన రైతుల పోరాటం, వారి దృఢత్వం గురించి చెబుతుంది. వారికి మన మద్దతు ఎంత అవసరమో కూడా చెబుతుంది.",
      "category": "social",
      "tags": ["రైతు", "వ్యవసాయం", "సమస్యలు", "పోరాటం"],
      "publishedDate": "2024-11-28",
      "readingTime": 15,
      "featured": false,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 203
    },
    {
      "id": "5",
      "title": "అక్క చెల్లెల బంధం",
      "excerpt": "అక్క చెల్లెల మధ్య ప్రేమ, పోటీ, త్యాగం. కుటుంబ పరిస్థితుల వల్ల వేర్పాటు అయిన వారు మళ్లీ కలుసుకోవడం...",
      "content": "సుమతి మరియు సుజాత అక్క చెల్లెలు. చిన్నప్పుడు చాలా దగ్గరగా ఉండేవారు. కానీ పెద్దయ్యాక కొన్ని విషయాలలో విభేదాలు వచ్చాయి...\n\nసుమతి పెళ్లి అయిన తర్వాత వేరే ఊరికి వెళ్లిపోయింది. సుజాత ఇంట్లోనే ఉండి అమ్మ నాన్నలను చూసుకుంటుంది. కాలక్రమేణా వారి మధ్య దూరం పెరిగింది.\n\nకానీ అమ్మ అనారోగ్యం వల్ల మళ్లీ కలుసుకున్నారు. ఆ సమయంలో వారికి అర్థమైంది - రక్త సంబంధాలు ఎంత గొప్పవో.",
      "category": "relationships",
      "tags": ["అక్క", "చెల్లెలు", "బంధం", "కుటుంబం"],
      "publishedDate": "2024-11-20",
      "readingTime": 9,
      "featured": false,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 178
    },
    {
      "id": "6",
      "title": "గ్రామ పాఠశాల గురువు",
      "excerpt": "గ్రామంలోని ప్రాథమిక పాఠశాలలో పనిచేసే గురువు, పిల్లల భవిష్యత్తు కోసం చేసే కృషి, ఎదుర్కొనే సవాళ్లు...",
      "content": "రమేష్ మాస్టర్ మా గ్రామ ప్రాథమిక పాఠశాలలో 20 సంవత్సరాలుగా పనిచేస్తున్నారు. వారికి విద్య అంటే ప్రాణం. ప్రతి పిల్లవాడి భవిష్యత్తు గురించి ఆలోచిస్తారు...\n\nపాఠశాలలో సరైన సౌకర్యాలు లేవు, పుస్తకాలు లేవు. కానీ రమేష్ మాస్టర్ తన జేబు డబ్బుతో పుస్తకాలు కొని పిల్లలకు ఇస్తారు.\n\nఈ కథ మన గురువుల త్యాగం, వారి అంకితభావం గురించి చెబుతుంది. విద్య ఎంత ముఖ్యమో కూడా చెబుతుంది.",
      "category": "social",
      "tags": ["గురువు", "విద్య", "గ్రామం", "పిల్లలు"],
      "publishedDate": "2024-11-15",
      "readingTime": 11,
      "featured": false,
      "image": "/placeholder.svg?height=300&width=400",
      "likes": 167
    }
  ]
}
